my_dict = {"H": 1, "Li": 7, "N": 14, "O": 16, "Na": 23}
print("Набор некоторых элементов Таблицы Менделеева с атомными массами", my_dict)
print("Атомная масса Лития:", my_dict["Li"])
print("Атомная масса Калия:", my_dict.get("K", "Такого элемента в наборе нет"))
my_dict.update({"Mg": 24, "Si": 28})
n = my_dict.pop("N")
print("Атомная масса удалённого элемента:", n)
print("Изменённый набор некоторых элементов Таблицы Менделеева с атомными массами", my_dict)
print()
set_ = {21, 29, 0.7, 'Король', 0.7, 21, 29, 'Король'}
print("Произволное множество", set_)
set_.discard(21)
set_.update([23, "Валет", 10, (1, 3, 5, 7, 9)])
print("Изменённое множество", set_)
